Catalogs/СредстваИндивидуальнойЗащиты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>СредстваИндивидуальнойЗащиты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьВыдачи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодичностьВыдачи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаПериодичностиВыдачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеПериодичностиВыдачи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользованиеХарактеристик</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыИспользованияХарактеристикНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособВыдачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыВыдачиСИЗ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецХарактеристик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/СпособыВыдачиСИЗ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СпособыВыдачиСИЗ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СПериодичностью</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоИзноса</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ВидыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВидыНоменклатуры</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаборСвойств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаборыДополнительныхРеквизитовИСведений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецХарактеристик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользованиеХарактеристик</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыИспользованияХарактеристикНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьХарактеристики</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтролироватьДублиХарактеристик</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаборСвойствХарактеристик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаборыДополнительныхРеквизитовИСведений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаборСвойствСИЗ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаборыДополнительныхРеквизитовИСведений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РеквизитыДляКонтроляНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Уникален</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяРеквизита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеРеквизита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоДопРеквизит</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаполнятьОбязательно</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтборПриВыборе</Name>
							<Comment>АПК:58</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтображатьПриСоздании</Name>
							<Comment>Истина - реквизит отображается в форме помощника ввода нового элемента номенклатуры, Ложь - не отображается</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоступностьУникален</Name>
							<Comment>АПК:58</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоступностьЗаполнятьОбязательно</Name>
							<Comment>АПК:58</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоступностьОтображатьПриСоздании</Name>
							<Comment>АПК:58</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РеквизитыДляКонтроляХарактеристик</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяРеквизита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеРеквизита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоДопРеквизит</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уникален</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаполнятьОбязательно</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтображатьПриСоздании</Name>
							<Comment>Истина - реквизит отображается в форме создания нового элемента характеристик, Ложь - не отображается</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоступностьУникален</Name>
							<Comment>АПК:58</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоступностьЗаполнятьОбязательно</Name>
							<Comment>АПК:58</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоступностьОтображатьПриСоздании</Name>
							<Comment>АПК:58</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РеквизитыБыстрогоОтбораНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяРеквизита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеРеквизита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоДопРеквизит</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Используется</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РеквизитыБыстрогоОтбораХарактеристик</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяРеквизита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеРеквизита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоДопРеквизит</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Используется</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/СредстваИндивидуальнойЗащиты/Ext/ManagerModule.bsl
// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ИнформационнаяСтрокаОСостоянииВыдачиПоСИЗ", Истина);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоРазделамДанных(Настройки, "ОхранаТруда");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПервоначальногоЗаполненияИОбновленияИБ

// Процедура выполняет первоначальное заполнение классификатора.
// 
// Параметры:
//  ВидыНоменклатуры - Массив Из СправочникСсылка.ВидыНоменклатуры
Процедура НачальноеЗаполнение(ВидыНоменклатуры) Экспорт
	
	ЗначенияВидовНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(
		ВидыНоменклатуры, "ТипНоменклатуры, ИспользованиеХарактеристик");
	ЗначенияРеквизитовСИЗ = Новый Соответствие;
	Для каждого ЗначенияВида Из ЗначенияВидовНоменклатуры Цикл
		РеквизитыСИЗ = НовыйРеквизитыСИЗ();
		РеквизитыСИЗ.ВидНоменклатуры = ЗначенияВида.Ключ;
		РеквизитыСИЗ.ИспользованиеХарактеристик = ЗначенияВида.Значение.ИспользованиеХарактеристик;
		ЗначенияРеквизитовСИЗ.Вставить(ЗначенияВида.Значение.ТипНоменклатуры, РеквизитыСИЗ);
	КонецЦикла;
	
	ЗаполнитьИзМакета(ЗначенияРеквизитовСИЗ);
	
КонецПроцедуры

Процедура ЗаполнитьИзМакета(ЗначенияРеквизитовСИЗ)
	
	НачатьТранзакцию();
	
	Попытка
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Справочник.СредстваИндивидуальнойЗащиты");
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Справочник.ВидыНоменклатуры");
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаДанных.Заблокировать();
	
		Запрос = Новый Запрос;
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СредстваИндивидуальнойЗащиты.Ссылка,
		|	СредстваИндивидуальнойЗащиты.Наименование
		|ИЗ
		|	Справочник.СредстваИндивидуальнойЗащиты КАК СредстваИндивидуальнойЗащиты";
			
		ТаблицаСуществующихСИЗ = Запрос.Выполнить().Выгрузить();
		
		ЕстьЭлементы = Не ТаблицаСуществующихСИЗ.Количество() = 0;
		
		ТекстовыйДокумент = ПолучитьМакет("КлассификаторНоменклатураЕТН");
		ТаблицаКлассификатора = ОбщегоНазначения.ПрочитатьXMLВТаблицу(ТекстовыйДокумент.ПолучитьТекст()).Данные;
		КодыОКЕИ = Новый Соответствие;
		
		Для каждого СтрокаКлассификатора Из ТаблицаКлассификатора Цикл
			Наименование = СтрокаКлассификатора["Name"]; //Строка
			НаименованиеПолное = СтрокаКлассификатора["FullName"]; //Строка
			КоличествоПоУмолчанию = СтрокаКлассификатора["Norm"]; //Строка
			КратностьВыдачи = СтрокаКлассификатора["FrequencyMultiplicity"]; //Строка
			ПериодичностьВыдачи = СтрокаКлассификатора["FrequencyRate"]; //Строка
			ЕдиницаПериодичностиВыдачи = СтрокаКлассификатора["FrequencyPeriod"]; //Строка
			КодОКЕИ = СтрокаКлассификатора["Unit"]; //Строка
			
			Если ЕстьЭлементы И ТаблицаСуществующихСИЗ.Найти(Наименование, "Наименование") <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			СправочникОбъект = СоздатьЭлемент();
			СправочникОбъект.Наименование = Наименование;
			СправочникОбъект.НаименованиеПолное = НаименованиеПолное;
			СправочникОбъект.ТипНоменклатуры = Перечисления.ТипыНоменклатуры[СтрокаКлассификатора["Type"]];
			
			РеквизитыСИЗ = ЗначенияРеквизитовСИЗ.Получить(СправочникОбъект.ТипНоменклатуры); //см. НовыйРеквизитыСИЗ()
			Если РеквизитыСИЗ = Неопределено Тогда
				МассивВидов = Новый Массив;
				Справочники.ВидыНоменклатуры.ДобавитьПредустановленныйВидНоменклатуры(МассивВидов,
					СправочникОбъект.ТипНоменклатуры, Строка(СправочникОбъект.ТипНоменклатуры));
				ВидНоменклатуры = МассивВидов[0]; //СправочникСсылка.ВидыНоменклатуры
				РеквизитыСИЗ = НовыйРеквизитыСИЗ();
				РеквизитыСИЗ.ВидНоменклатуры = ВидНоменклатуры;
				РеквизитыСИЗ.ИспользованиеХарактеристик =
					ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидНоменклатуры, "ИспользованиеХарактеристик");
				ЗначенияРеквизитовСИЗ.Вставить(СправочникОбъект.ТипНоменклатуры, РеквизитыСИЗ);
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(СправочникОбъект, РеквизитыСИЗ);
			
			Если Не ПустаяСтрока(КоличествоПоУмолчанию) Тогда
				СправочникОбъект.КоличествоПоУмолчанию = Число(КоличествоПоУмолчанию);
			КонецЕсли;
			
			ЕдиницаИзмерения = КодыОКЕИ.Получить(КодОКЕИ); //СправочникСсылка.КлассификаторЕдиницИзмерения
			Если ЕдиницаИзмерения = Неопределено Тогда
				СправочникОбъект.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.ЕдиницаИзмеренияПоКоду(КодОКЕИ);
				КодыОКЕИ.Вставить(КодОКЕИ, СправочникОбъект.ЕдиницаИзмерения);
			Иначе
				СправочникОбъект.ЕдиницаИзмерения = ЕдиницаИзмерения;
			КонецЕсли;
			
			Если Не ПустаяСтрока(ЕдиницаПериодичностиВыдачи) Тогда
				СправочникОбъект.КратностьВыдачи = Число(КратностьВыдачи);
				СправочникОбъект.ПериодичностьВыдачи = Число(ПериодичностьВыдачи);
				СправочникОбъект.ЕдиницаПериодичностиВыдачи = Перечисления.Периодичность[ЕдиницаПериодичностиВыдачи];
				СправочникОбъект.СпособВыдачи = Перечисления.СпособыВыдачиСИЗ.СПериодичностью;
			Иначе
				СправочникОбъект.СпособВыдачи = Перечисления.СпособыВыдачиСИЗ.ДоИзноса;
			КонецЕсли;
			СоздатьОбновитьДополнительныеРеквизиты(СтрокаКлассификатора, СправочникОбъект);
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СправочникОбъект);
		КонецЦикла;
		
		Для Каждого РеквизитыСИЗ Из ЗначенияРеквизитовСИЗ Цикл
			ВидНоменклатурыОбъект = РеквизитыСИЗ.Значение.ВидНоменклатуры.ПолучитьОбъект();
			ВидНоменклатурыОбъект.РеквизитыДляКонтроляНоменклатуры.Очистить();
			ВидНоменклатурыОбъект.РеквизитыБыстрогоОтбораНоменклатуры.Очистить();
			Справочники.ВидыНоменклатуры.ЗаполнитьДопРеквизитыДляКонтроляИОтбора(ВидНоменклатурыОбъект, "Номенклатура");
			Для Каждого Реквизит Из ВидНоменклатурыОбъект.РеквизитыДляКонтроляНоменклатуры Цикл
				Если Не Реквизит.ЭтоДопРеквизит Тогда
					Продолжить;
				КонецЕсли;
				НоваяСтрока = ВидНоменклатурыОбъект.РеквизитыБыстрогоОтбораНоменклатуры.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Реквизит);
				НоваяСтрока.Используется = Истина;
			КонецЦикла;
			ВидНоменклатурыОбъект.Записать();
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		
		ПредставлениеОбработки = НСтр("ru = 'Заполнение средств индивидуальной защиты из классификатора'"); 
		ИмяСобытия = НСтр("ru = 'Средства индивидуальной защиты'", ОбщегоНазначения.КодОсновногоЯзыка());
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, 
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
		
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Ошибка при обработке средств индивидуальной защиты. Обратитесь к администратору.
					|Техническая информация:
					|При выполнении операции «%1» возникает
					|%2'"), 
			ПредставлениеОбработки,
			ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке));
		
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

Функция НовыйРеквизитыСИЗ()
	
	РеквизитыСИЗ = Новый Структура;
	РеквизитыСИЗ.Вставить("ВидНоменклатуры", Справочники.ВидыНоменклатуры.ПустаяСсылка());
	РеквизитыСИЗ.Вставить("ИспользованиеХарактеристик", Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.ПустаяСсылка());
	
	Возврат РеквизитыСИЗ;
	
КонецФункции

Процедура СоздатьОбновитьДополнительныеРеквизиты(СтрокаКлассификатора, СправочникОбъект)
	
	ВидНоменклатуры = СправочникОбъект.ВидНоменклатуры;
	
	Если СтрокаКлассификатора["MoltenMetal"] = "True" Тогда
		СоздатьОбновитьДополнительныйРеквизит(ВидНоменклатуры, НСтр("ru = 'Защита от выплесков расплавленного металла'"));
		СоздатьОбновитьДополнительныйРеквизит(ВидНоменклатуры, НСтр("ru = 'Защита от выплесков расплавленного металла'"),
			"НаборСвойствСИЗ", "Справочник_СредстваИндивидуальнойЗащиты", СправочникОбъект);
	КонецЕсли;
	Если СтрокаКлассификатора["Sparks"] = "True" Тогда
		СоздатьОбновитьДополнительныйРеквизит(ВидНоменклатуры, НСтр("ru = 'Защита от искр и брызг расплавленного металла, металлической окалины'"));
		СоздатьОбновитьДополнительныйРеквизит(ВидНоменклатуры, НСтр("ru = 'Защита от искр и брызг расплавленного металла, металлической окалины'"),
			"НаборСвойствСИЗ", "Справочник_СредстваИндивидуальнойЗащиты", СправочникОбъект);
	КонецЕсли;
	Если СтрокаКлассификатора["ConvectiveHeat"] = "True" Тогда
		СоздатьОбновитьДополнительныйРеквизит(ВидНоменклатуры, НСтр("ru = 'Защита от конвективной теплоты'"));
		СоздатьОбновитьДополнительныйРеквизит(ВидНоменклатуры, НСтр("ru = 'Защита от конвективной теплоты'"),
			"НаборСвойствСИЗ", "Справочник_СредстваИндивидуальнойЗащиты", СправочникОбъект);
	КонецЕсли;
	Если СтрокаКлассификатора["ThermalRadiation"] = "True" Тогда
		СоздатьОбновитьДополнительныйРеквизит(ВидНоменклатуры, НСтр("ru = 'Защита от теплового излучения'"));
		СоздатьОбновитьДополнительныйРеквизит(ВидНоменклатуры, НСтр("ru = 'Защита от теплового излучения'"),
			"НаборСвойствСИЗ", "Справочник_СредстваИндивидуальнойЗащиты", СправочникОбъект);
	КонецЕсли;
	Если СтрокаКлассификатора["Abrasion"] = "True" Тогда
		СоздатьОбновитьДополнительныйРеквизит(ВидНоменклатуры, НСтр("ru = 'Защита от механических воздействий (истирания)'"));
		СоздатьОбновитьДополнительныйРеквизит(ВидНоменклатуры, НСтр("ru = 'Защита от механических воздействий (истирания)'"),
			"НаборСвойствСИЗ", "Справочник_СредстваИндивидуальнойЗащиты", СправочникОбъект);
	КонецЕсли;
	Если СтрокаКлассификатора["Cuts"] = "True" Тогда
		СоздатьОбновитьДополнительныйРеквизит(ВидНоменклатуры, НСтр("ru = 'Защита от механических воздействий (порезов)'"));
		СоздатьОбновитьДополнительныйРеквизит(ВидНоменклатуры, НСтр("ru = 'Защита от механических воздействий (порезов)'"),
			"НаборСвойствСИЗ", "Справочник_СредстваИндивидуальнойЗащиты", СправочникОбъект);
	КонецЕсли;
	Если СтрокаКлассификатора["Punctures"] = "True" Тогда
		СоздатьОбновитьДополнительныйРеквизит(ВидНоменклатуры, НСтр("ru = 'Защита от механических воздействий (проколов)'"));
		СоздатьОбновитьДополнительныйРеквизит(ВидНоменклатуры, НСтр("ru = 'Защита от механических воздействий (проколов)'"),
			"НаборСвойствСИЗ", "Справочник_СредстваИндивидуальнойЗащиты", СправочникОбъект);
	КонецЕсли;
	Если СтрокаКлассификатора["ParticulateImpact"] = "True" Тогда
		СоздатьОбновитьДополнительныйРеквизит(ВидНоменклатуры, НСтр("ru = 'Защита от механических воздействий (ударов твердых частиц)'"));
		СоздатьОбновитьДополнительныйРеквизит(ВидНоменклатуры, НСтр("ru = 'Защита от механических воздействий (ударов твердых частиц)'"),
			"НаборСвойствСИЗ", "Справочник_СредстваИндивидуальнойЗащиты", СправочникОбъект);
	КонецЕсли;
	Если СтрокаКлассификатора["Blows"] = "True" Тогда
		СоздатьОбновитьДополнительныйРеквизит(ВидНоменклатуры, НСтр("ru = 'Защита от механических воздействий (ударов)'"));
		СоздатьОбновитьДополнительныйРеквизит(ВидНоменклатуры, НСтр("ru = 'Защита от механических воздействий (ударов)'"),
			"НаборСвойствСИЗ", "Справочник_СредстваИндивидуальнойЗащиты", СправочникОбъект);
	КонецЕсли;
	Если СтрокаКлассификатора["OpenAlame"] = "True" Тогда
		СоздатьОбновитьДополнительныйРеквизит(ВидНоменклатуры, НСтр("ru = 'Защита от кратковременного воздействия открытого пламени'"));
		СоздатьОбновитьДополнительныйРеквизит(ВидНоменклатуры, НСтр("ru = 'Защита от кратковременного воздействия открытого пламени'"),
			"НаборСвойствСИЗ", "Справочник_СредстваИндивидуальнойЗащиты", СправочникОбъект);
	КонецЕсли;
	Если СтрокаКлассификатора["GeneralIndustrialPollution"] = "True" Тогда
		СоздатьОбновитьДополнительныйРеквизит(ВидНоменклатуры, НСтр("ru = 'Защита от общих производственных загрязнений'"));
		СоздатьОбновитьДополнительныйРеквизит(ВидНоменклатуры, НСтр("ru = 'Защита от общих производственных загрязнений'"),
			"НаборСвойствСИЗ", "Справочник_СредстваИндивидуальнойЗащиты", СправочникОбъект);
	КонецЕсли;
	Если СтрокаКлассификатора["HotSurfaceContact"] = "True" Тогда
		СоздатьОбновитьДополнительныйРеквизит(ВидНоменклатуры, НСтр("ru = 'Защита от контакта с нагретой поверхностью'"));
		СоздатьОбновитьДополнительныйРеквизит(ВидНоменклатуры, НСтр("ru = 'Защита от контакта с нагретой поверхностью'"),
			"НаборСвойствСИЗ", "Справочник_СредстваИндивидуальнойЗащиты", СправочникОбъект);
	КонецЕсли;
	Если СтрокаКлассификатора["ColdSurfaceContact"] = "True" Тогда
		СоздатьОбновитьДополнительныйРеквизит(ВидНоменклатуры, НСтр("ru = 'Защита от контакта с охлажденной поверхностью'"));
		СоздатьОбновитьДополнительныйРеквизит(ВидНоменклатуры, НСтр("ru = 'Защита от контакта с охлажденной поверхностью'"),
			"НаборСвойствСИЗ", "Справочник_СредстваИндивидуальнойЗащиты", СправочникОбъект);
	КонецЕсли;
	Если СтрокаКлассификатора["AcidSolutions"] = "True" Тогда
		СоздатьОбновитьДополнительныйРеквизит(ВидНоменклатуры, НСтр("ru = 'Защита от растворов кислот'"));
		СоздатьОбновитьДополнительныйРеквизит(ВидНоменклатуры, НСтр("ru = 'Защита от растворов кислот'"),
			"НаборСвойствСИЗ", "Справочник_СредстваИндивидуальнойЗащиты", СправочникОбъект);
	КонецЕсли;
	Если СтрокаКлассификатора["AlkaliSolutions"] = "True" Тогда
		СоздатьОбновитьДополнительныйРеквизит(ВидНоменклатуры, НСтр("ru = 'Защита от растворов щелочей'"));
		СоздатьОбновитьДополнительныйРеквизит(ВидНоменклатуры, НСтр("ru = 'Защита от растворов щелочей'"),
			"НаборСвойствСИЗ", "Справочник_СредстваИндивидуальнойЗащиты", СправочникОбъект);
	КонецЕсли;
	Если СтрокаКлассификатора["NonToxicSubstances"] = "True" Тогда
		СоздатьОбновитьДополнительныйРеквизит(ВидНоменклатуры, НСтр("ru = 'Защита от растворов нетоксичных веществ'"));
		СоздатьОбновитьДополнительныйРеквизит(ВидНоменклатуры, НСтр("ru = 'Защита от растворов нетоксичных веществ'"),
			"НаборСвойствСИЗ", "Справочник_СредстваИндивидуальнойЗащиты", СправочникОбъект);
	КонецЕсли;
	Если СтрокаКлассификатора["StaticElectricity"] = "True" Тогда
		СоздатьОбновитьДополнительныйРеквизит(ВидНоменклатуры, НСтр("ru = 'Защита от воздействия статического электричества'"));
		СоздатьОбновитьДополнительныйРеквизит(ВидНоменклатуры, НСтр("ru = 'Защита от воздействия статического электричества'"),
			"НаборСвойствСИЗ", "Справочник_СредстваИндивидуальнойЗащиты", СправочникОбъект);
	КонецЕсли;
	Если СтрокаКлассификатора["Oil"] = "True" Тогда
		СоздатьОбновитьДополнительныйРеквизит(ВидНоменклатуры, НСтр("ru = 'Защита от нефти и/или нефтепродуктов'"));
		СоздатьОбновитьДополнительныйРеквизит(ВидНоменклатуры, НСтр("ru = 'Защита от нефти и/или нефтепродуктов'"),
			"НаборСвойствСИЗ", "Справочник_СредстваИндивидуальнойЗащиты", СправочникОбъект);
	КонецЕсли;
	Если СтрокаКлассификатора["Water"] = "True" Тогда
		СоздатьОбновитьДополнительныйРеквизит(ВидНоменклатуры, НСтр("ru = 'Защита от воды'"));
		СоздатьОбновитьДополнительныйРеквизит(ВидНоменклатуры, НСтр("ru = 'Защита от воды'"),
			"НаборСвойствСИЗ", "Справочник_СредстваИндивидуальнойЗащиты", СправочникОбъект);
	КонецЕсли;
	Если СтрокаКлассификатора["NonToxicDust"] = "True" Тогда
		СоздатьОбновитьДополнительныйРеквизит(ВидНоменклатуры, НСтр("ru = 'Защита от нетоксичной пыли'"));
		СоздатьОбновитьДополнительныйРеквизит(ВидНоменклатуры, НСтр("ru = 'Защита от нетоксичной пыли'"),
			"НаборСвойствСИЗ", "Справочник_СредстваИндивидуальнойЗащиты", СправочникОбъект);
	КонецЕсли;
	Если СтрокаКлассификатора["Vibration"] = "True" Тогда
		СоздатьОбновитьДополнительныйРеквизит(ВидНоменклатуры, НСтр("ru = 'Защита от вибрации'"));
		СоздатьОбновитьДополнительныйРеквизит(ВидНоменклатуры, НСтр("ru = 'Защита от вибрации'"),
			"НаборСвойствСИЗ", "Справочник_СредстваИндивидуальнойЗащиты", СправочникОбъект);
	КонецЕсли;
	Если СтрокаКлассификатора["Slip"] = "True" Тогда
		СоздатьОбновитьДополнительныйРеквизит(ВидНоменклатуры, НСтр("ru = 'Защита от скольжения'"));
		СоздатьОбновитьДополнительныйРеквизит(ВидНоменклатуры, НСтр("ru = 'Защита от скольжения'"),
			"НаборСвойствСИЗ", "Справочник_СредстваИндивидуальнойЗащиты", СправочникОбъект);
	КонецЕсли;
	Если СтрокаКлассификатора["Mosquito"] = "True" Тогда
		СоздатьОбновитьДополнительныйРеквизит(ВидНоменклатуры, НСтр("ru = 'Защита от вредных биологических факторов (клещей и кровососущих насекомых)'"));
		СоздатьОбновитьДополнительныйРеквизит(ВидНоменклатуры, НСтр("ru = 'Защита от вредных биологических факторов (клещей и кровососущих насекомых)'"),
			"НаборСвойствСИЗ", "Справочник_СредстваИндивидуальнойЗащиты", СправочникОбъект);
	КонецЕсли;
	Если СтрокаКлассификатора["LowTemperatures"] = "True" Тогда
		СоздатьОбновитьДополнительныйРеквизит(ВидНоменклатуры, НСтр("ru = 'Защита от пониженных температур'"));
		СоздатьОбновитьДополнительныйРеквизит(ВидНоменклатуры, НСтр("ru = 'Защита от пониженных температур'"),
			"НаборСвойствСИЗ", "Справочник_СредстваИндивидуальнойЗащиты", СправочникОбъект);
	КонецЕсли;
	Если СтрокаКлассификатора["ElevatedTemperatures"] = "True" Тогда
		СоздатьОбновитьДополнительныйРеквизит(ВидНоменклатуры, НСтр("ru = 'Защита от повышенных температур'"));
		СоздатьОбновитьДополнительныйРеквизит(ВидНоменклатуры, НСтр("ru = 'Защита от повышенных температур'"),
			"НаборСвойствСИЗ", "Справочник_СредстваИндивидуальнойЗащиты", СправочникОбъект);
	КонецЕсли;
	Если СтрокаКлассификатора["ChainSaw"] = "True" Тогда
		СоздатьОбновитьДополнительныйРеквизит(ВидНоменклатуры, НСтр("ru = 'Защита от режущего воздействия ручной цепной пилой'"));
		СоздатьОбновитьДополнительныйРеквизит(ВидНоменклатуры, НСтр("ru = 'Защита от режущего воздействия ручной цепной пилой'"),
			"НаборСвойствСИЗ", "Справочник_СредстваИндивидуальнойЗащиты", СправочникОбъект);
	КонецЕсли;
	Если СтрокаКлассификатора["ElectricArc"] = "True" Тогда
		СоздатьОбновитьДополнительныйРеквизит(ВидНоменклатуры, НСтр("ru = 'Защита от термических рисков электрической дуги'"));
		СоздатьОбновитьДополнительныйРеквизит(ВидНоменклатуры, НСтр("ru = 'Защита от термических рисков электрической дуги'"),
			"НаборСвойствСИЗ", "Справочник_СредстваИндивидуальнойЗащиты", СправочникОбъект);
	КонецЕсли;
	Если СтрокаКлассификатора["MechanicalInfluences"] = "True" Тогда
		СоздатьОбновитьДополнительныйРеквизит(ВидНоменклатуры, НСтр("ru = 'Защита от механических воздействий'"));
		СоздатьОбновитьДополнительныйРеквизит(ВидНоменклатуры, НСтр("ru = 'Защита от механических воздействий'"),
			"НаборСвойствСИЗ", "Справочник_СредстваИндивидуальнойЗащиты", СправочникОбъект);
	КонецЕсли;
	
КонецПроцедуры

Процедура СоздатьОбновитьДополнительныйРеквизит(ВидНоменклатуры, Наименование, ИмяНабораСвойств = "НаборСвойств",
		ИмяОбъектаСоСвойствами = "Справочник_Номенклатура", СИЗ = Неопределено)
	
	СредстваИндивидуальнойЗащиты.СоздатьОбновитьДополнительныйРеквизит(
		ВидНоменклатуры, Наименование, ИмяНабораСвойств, ИмяОбъектаСоСвойствами, СИЗ);
	
КонецПроцедуры

#КонецОбласти

// Таблица использования СИЗВРабочих местах.
// 
// Параметры:
//  СИЗ - Массив Из СправочникСсылка.СредстваИндивидуальнойЗащиты
//  ПараметрыСписка - Структура:
//   *Организация - СправочникСсылка.Организации
//   *Подразделение - СправочникСсылка.ПодразделенияОрганизаций
//   *ДатаАктуальности - Дата
// 
// Возвращаемое значение:
//  ТаблицаЗначений - см. НоваяТаблицаИспользованияСИЗВРабочихМестах
// 
Функция ТаблицаИспользованияСИЗВРабочихМестах(СИЗ, ПараметрыСписка) Экспорт
	
	ТаблицаИнформационныхСтрок = НоваяТаблицаИспользованияСИЗВРабочихМестах();
	
	Для Каждого ЭлементСИЗ Из СИЗ Цикл
		НоваяСтрока = ТаблицаИнформационныхСтрок.Добавить();
		НоваяСтрока.СИЗ = ЭлементСИЗ;
	КонецЦикла;
	
	ЗаполнитьСведенияИспользованияСИЗВРабочихМестах(ТаблицаИнформационныхСтрок, СИЗ, ПараметрыСписка);
	
	Возврат ТаблицаИнформационныхСтрок;
	
КонецФункции

// Новая таблица использования СИЗ в рабочих местах.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Новая таблица использования СИЗВРабочих местах:
// * СИЗ - СправочникСсылка.СредстваИндивидуальнойЗащиты
// * РабочиеМестаСИЗ - Массив Из СправочникСсылка.РабочиеМестаОхраныТруда
// * КоличествоРабочихМест - Число
// * СотрудникиСИЗ - Массив Из Структура:
//   ** Сотрудник - СправочникСсылка.ФизическиеЛица
//   ** СИЗ - СправочникСсылка.СредстваИндивидуальнойЗащиты
//   ** РабочееМесто - СправочникСсылка.РабочиеМестаОхраныТруда
//   ** ДатаСледующейВыдачи - Дата
//   ** ПериодичностьМесяц - Булево
//   ** Требуется - Булево
//   ** ДоступноДляПодбора - Булево
//   ** Пометка - Булево
//   ** Выдано - Булево
// * КоличествоСотрудников - Число
// * КоличествоВыданныхСотрудникам - Число
// * ИнформационнаяСтрокаОСостоянииВыдачи - ФорматированнаяСтрока
// * Требуется - Булево
Функция НоваяТаблицаИспользованияСИЗВРабочихМестах()
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("СИЗ", Новый ОписаниеТипов("СправочникСсылка.СредстваИндивидуальнойЗащиты"));
	Таблица.Колонки.Добавить("РабочиеМестаСИЗ", Новый ОписаниеТипов("Массив"));
	Таблица.Колонки.Добавить("КоличествоРабочихМест", Новый ОписаниеТипов("Число"));
	Таблица.Колонки.Добавить("СотрудникиСИЗ", Новый ОписаниеТипов("Массив"));
	Таблица.Колонки.Добавить("КоличествоСотрудников", Новый ОписаниеТипов("Число"));
	Таблица.Колонки.Добавить("КоличествоВыданныхСотрудникам", Новый ОписаниеТипов("Число"));
	Таблица.Колонки.Добавить("ИнформационнаяСтрокаОСостоянииВыдачи", Новый ОписаниеТипов("ФорматированнаяСтрока"));
	Таблица.Колонки.Добавить("Требуется", Новый ОписаниеТипов("Булево"));
	
	Возврат Таблица;
	
КонецФункции

// Заполняет сведения использования СИЗ в рабочих местах.
// 
// Параметры:
//  ДанныеСИЗ - см. НоваяТаблицаИспользованияСИЗВРабочихМестах
//  СИЗ - Массив Из СправочникСсылка.СредстваИндивидуальнойЗащиты
//  ПараметрыСписка - Структура:
//   *Организация - СправочникСсылка.Организации
//   *Подразделение - СправочникСсылка.ПодразделенияОрганизаций
//   *ДатаАктуальности - Дата
Процедура ЗаполнитьСведенияИспользованияСИЗВРабочихМестах(ДанныеСИЗ, СИЗ, ПараметрыСписка)
	
	Если ДанныеСИЗ.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеРабочихМест = Новый ТаблицаЗначений;
	НормыВыдачиСИЗФизическихЛиц = СредстваИндивидуальнойЗащиты.НормыВыдачиСИЗФизическихЛиц(ПараметрыСписка, СИЗ, ДанныеРабочихМест);
	
	ДанныеРабочихМест.Индексы.Добавить("СИЗ");
	
	ОтборСтрок = Новый Структура("СИЗ", ПустаяСсылка());
	Для Каждого СтрокаДанныхСИЗ Из ДанныеСИЗ Цикл
		ЗаполнитьЗначенияСвойств(ОтборСтрок, СтрокаДанныхСИЗ);
		ДанныеРабочихМестПоСИЗ = ДанныеРабочихМест.НайтиСтроки(ОтборСтрок);
		СтрокаДанныхСИЗ.КоличествоРабочихМест = ДанныеРабочихМестПоСИЗ.Количество();
		Для Каждого СтрокаРабочегоМеста Из ДанныеРабочихМестПоСИЗ Цикл
			РабочееМесто = СтрокаРабочегоМеста.РабочееМесто; // СправочникСсылка.РабочиеМестаОхраныТруда
			СтрокаДанныхСИЗ.РабочиеМестаСИЗ.Добавить(РабочееМесто);
		КонецЦикла;
		ДанныеСотрудников = НормыВыдачиСИЗФизическихЛиц.НайтиСтроки(ОтборСтрок);
		СтрокаДанныхСИЗ.КоличествоСотрудников = ДанныеСотрудников.Количество();
		Для Каждого СтрокаСотрудника Из ДанныеСотрудников Цикл
			Если СтрокаСотрудника.Выдано Тогда
				СтрокаДанныхСИЗ.КоличествоВыданныхСотрудникам = СтрокаДанныхСИЗ.КоличествоВыданныхСотрудникам + 1;
			КонецЕсли;
			СтрокаДанныхСИЗ.СотрудникиСИЗ.Добавить(ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(СтрокаСотрудника));
		КонецЦикла;
		ЗаполнитьИнформационнуюСтрокуОСостоянииВыдачи(СтрокаДанныхСИЗ);
	КонецЦикла;
	
КонецПроцедуры

// Информационная строка о состоянии выдачи по СИЗ.
// 
// Параметры:
//  СИЗ - Массив Из СправочникСсылка.СредстваИндивидуальнойЗащиты
//  ПараметрыСписка - Структура:
//   *Организация - СправочникСсылка.Организации
//   *Подразделение - СправочникСсылка.ПодразделенияОрганизаций
//   *ДатаАктуальности - Дата
// 
// Возвращаемое значение:
//  Неопределено, Структура - Информационная строка о состоянии выдачи по СИЗ
Функция ИнформационнаяСтрокаОСостоянииВыдачиПоСИЗ(СИЗ, ПараметрыСписка) Экспорт

	ТаблицаИнформационныхСтрок = ТаблицаИспользованияСИЗВРабочихМестах(СИЗ, ПараметрыСписка);
	Если ТаблицаИнформационныхСтрок.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ТаблицаИнформационныхСтрок[0]);
	
КонецФункции

Процедура ЗаполнитьИнформационнуюСтрокуОСостоянииВыдачи(СтрокаТаблицы)
	
	НеВыданоСотрудникам = СтрокаТаблицы.КоличествоСотрудников - СтрокаТаблицы.КоличествоВыданныхСотрудникам;
	
	Если СтрокаТаблицы.КоличествоСотрудников > 0 Тогда
		ТекстНеВыданоСотрудникам = ТекстНадписи(
			НСтр("ru = ';Требуется выдать %1 сотруднику;;Требуется выдать %1 сотрудникам;Требуется выдать %1 сотрудникам;Требуется выдать %1 сотрудникам'"), 
			НСтр("ru = 'Выдача не требуется'"), 
			НеВыданоСотрудникам);
		
		СотрудникиОжидаютВыдачи = Новый Массив; // Массив Из СправочникСсылка.ФизическиеЛица
		СотрудникиВыдано = Новый Массив; // Массив Из СправочникСсылка.ФизическиеЛица
		
		Для Каждого СтрокаСотрудник Из СтрокаТаблицы.СотрудникиСИЗ Цикл
			Если СтрокаСотрудник.ДоступноДляПодбора Тогда
				СотрудникиОжидаютВыдачи.Добавить(СтрокаСотрудник.Сотрудник);
			Иначе
				СотрудникиВыдано.Добавить(СтрокаСотрудник.Сотрудник);
			КонецЕсли;
		КонецЦикла;
		
		ИменаНавигационныхСсылок = СредстваИндивидуальнойЗащитыКлиентСервер.ИменаНавигационныхСсылокСостоянийВыдачиСотрудникам();
		
		ТекстПоСотрудникамОжидаютВыдачи = ТекстПоСотрудникам(СотрудникиОжидаютВыдачи, ИменаНавигационныхСсылок.ОжидаютВыдачи);
		
		ТекстВыданоСотрудникам = ТекстНадписи(
			НСтр("ru = ';ранее выдано %1 сотруднику;;ранее выдано %1 сотрудникам;ранее выдано %1 сотрудникам;ранее выдано %1 сотрудникам'"), 
			НСтр("ru = 'ранее не выдавалось или срок носки истек'"), 
			СтрокаТаблицы.КоличествоВыданныхСотрудникам);
		
		ТекстПоСотрудникамВыдано = ТекстПоСотрудникам(СотрудникиВыдано, ИменаНавигационныхСсылок.Выдано);
		Если ПустаяСтрока(ТекстПоСотрудникамВыдано) Тогда
			ИнформационнаяСтрокаОСостоянииВыдачи = СтроковыеФункции.ФорматированнаяСтрока(
				НСтр("ru='<span style=""font:ВажнаяНадписьШрифт"">%1</span>%2, %3.'"),
				ТекстНеВыданоСотрудникам, ТекстПоСотрудникамОжидаютВыдачи, ТекстВыданоСотрудникам);
		ИначеЕсли ПустаяСтрока(ТекстПоСотрудникамОжидаютВыдачи) Тогда
			ИнформационнаяСтрокаОСостоянииВыдачи = СтроковыеФункции.ФорматированнаяСтрока(
				НСтр("ru='<span style=""font:ВажнаяНадписьШрифт"">%1</span>, %2%3.'"),
				ТекстНеВыданоСотрудникам, ТекстВыданоСотрудникам, ТекстПоСотрудникамВыдано);
		Иначе
			ИнформационнаяСтрокаОСостоянииВыдачи = СтроковыеФункции.ФорматированнаяСтрока(
				НСтр("ru='<span style=""font:ВажнаяНадписьШрифт"">%1</span>%2, %3%4.'"),
				ТекстНеВыданоСотрудникам, ТекстПоСотрудникамОжидаютВыдачи, ТекстВыданоСотрудникам, ТекстПоСотрудникамВыдано);
		КонецЕсли;
	Иначе
		ИнформационнаяСтрокаОСостоянииВыдачи = СтроковыеФункции.ФорматированнаяСтрока(
			НСтр("ru='<span style=""font:ВажнаяНадписьШрифт"">Отсутствует в нормах сотрудников.</span>'"));
	КонецЕсли;
	
	СтрокаТаблицы.ИнформационнаяСтрокаОСостоянииВыдачи = ИнформационнаяСтрокаОСостоянииВыдачи;
	
КонецПроцедуры

// Текст по сотрудникам.
// 
// Параметры:
//  Сотрудники - Массив Из СправочникСсылка.ФизическиеЛица - Сотрудники
//  ИмяНавигационнойСсылки - Строка
Функция ТекстПоСотрудникам(Сотрудники, ИмяНавигационнойСсылки)
	
	КоличествоСотрудников = Сотрудники.Количество();
	Если КоличествоСотрудников = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстПоСотрудникам = "";
	СотрудниковВключено = 0;
	Для Каждого Сотрудник Из Сотрудники Цикл
		Если СотрудниковВключено = 3 Тогда
			Прервать;
		КонецЕсли;
		ФамилияИнициалы = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Строка(Сотрудник));
		Если СотрудниковВключено > 0 Тогда
			Шаблон = НСтр("ru = '%1, <a href=""%2"">%3</a>'");
			ТекстПоСотрудникам = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				Шаблон, ТекстПоСотрудникам, ПолучитьНавигационнуюСсылку(Сотрудник), ФамилияИнициалы);
		Иначе
			Шаблон = НСтр("ru = '<a href=""%1"">%2</a>'");
			ТекстПоСотрудникам = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				Шаблон, ПолучитьНавигационнуюСсылку(Сотрудник), ФамилияИнициалы);
		КонецЕсли;
		СотрудниковВключено = СотрудниковВключено + 1;
	КонецЦикла;
	
	ЕщеОсталось = КоличествоСотрудников - СотрудниковВключено;
	Если ЕщеОсталось > 0 Тогда
		ТекстПоСотрудникам = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = '%1 и <a href=""%2"">еще %3</a>'"), ТекстПоСотрудникам, ИмяНавигационнойСсылки, Строка(ЕщеОсталось));
	КонецЕсли;
	
	Возврат ТекстПоСотрудникам;
	
КонецФункции

// Текст надписи.
// 
// Параметры:
//  Шаблон - Строка
//  ШаблонДляНуля - Строка
//  Число - Число
// 
// Возвращаемое значение:
//  Строка - Текст надписи
Функция ТекстНадписи(Шаблон, ШаблонДляНуля, Число)
	
	Если Число = 0 Тогда
		Возврат ШаблонДляНуля;
	КонецЕсли;
	
	Возврат СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(Шаблон, Число);
	
КонецФункции

#КонецОбласти

#КонецЕсли
